app/views/carts/show.html.erb

<table>
    <% @cart.line_items.each do |line_item| %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 11