app/controllers/line_items_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 31 Aug 2012 02:44:00 UTC +00:00], ["updated_at", Fri, 31 Aug 2012 02:44:00 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "food_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 10], ["created_at", Fri, 31 Aug 2012 03:04:02 UTC +00:00], ["food_id", 2], ["quantity", 1], ["updated_at", Fri, 31 Aug 2012 03:04:02 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2012-08-31 03:18:20.361106' WHERE "line_items"."id" = 8
---
  def create
    food_id = params[:food_id]
    @cart = current_cart
    @line_item = @cart.add_product(food_id)
    respond_to do |format|
      if @line_item.save