app/controllers/store_controller.rb

  def index
    @foods = Food.order(:title)
---
SELECT "foods".* FROM "foods" ORDER BY title