app/controllers/users_controller.rb

  def create
       @user = create_user(params[:user])
       respond_to do |format|
        if @user.save
---
INSERT INTO "users" ("address", "created_at", "email", "name", "password", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    original_infor = check_old_pass_user(@user,params[:user][:old_password])
    respond_to do |format|
      if @user.update_attributes(original_infor)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = 'Duc Trinh', "username" = 'ty_edge_540t', "password" = 'e10adc3949ba59abbe56e057f20f883e', "email" = 'duc.trinh@eastagile.com', "address" = 'dsadsadada', "updated_at" = '2012-08-29 08:01:18.677920' WHERE "users"."id" = 18